reddit_on_rails/app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)
    @post.author_id = params[:user_id]
    if @post.save
---
INSERT INTO "posts" ("title", "url", "content", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def destroy
    sub_id = @post.sub_id
    @post.destroy
---
DELETE FROM "post_subs" WHERE "post_subs"."post_id" = $1 AND "post_subs"."sub_id" = $2  [["post_id", 23], ["sub_id", 10]]

  def update
    if @post.author_id == current_user.id
      if @post.update(post_params)
---
UPDATE "posts" SET "url" = $1, "content" = $2, "updated_at" = $3 WHERE "posts"."id" = $4  [["url", ""], ["content", "Look at this little guy"], ["updated_at", "2018-09-18 22:39:04.760286"], ["id", 11]]