reddit_on_rails/app/controllers/subs_controller.rb

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def find_sub
    @sub = Sub.find(params[:id])