reddit_on_rails/app/views/posts/_form.html.erb

SELECT "subs".* FROM "subs"
SELECT "subs"."id" FROM "subs" INNER JOIN "post_subs" ON "subs"."id" = "post_subs"."sub_id" WHERE "post_subs"."post_id" = $1  [["post_id", 23]]
---
  <label>Subs:
    <% Sub.all.each do |sub| %>
    <label><%= sub.title %>
      <input type="checkbox" name="post[sub_ids][]" value="<%= sub.id %>" <%= post.sub_ids.include?(sub.id) ? "checked" : "" %>>