reddit_on_rails/app/models/user.rb

  def self.find_by_credentials(username, pw)
    user = User.find_by(username: username)
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "amandashow"], ["LIMIT", 1]]

  def reset_session_token!
    self.session_token = User.session_token
    self.save
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "PWGT1K-6_SWFxFsjZ8PqiQ"], ["updated_at", "2018-09-18 18:46:27.180825"], ["id", 1]]